src/InformationRegisters/ПРО_ПереопределяемыеПравилаРегистрацииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПРО_ПереопределяемыеПравилаРегистрацииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РегистрацияОбъектаРазрешена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоПОД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименитьСобственноеПравило</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИсполняемыйКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелИнформационнойБазы</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_УзелПланаОбмена</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРегистрации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПРО_ИдентификаторОбъектаМетаданных</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ПРО_ПереопределяемыеПравилаРегистрацииОбъектов/Ext/ManagerModule.bsl
////////////////////////////////////////////////////////////////////////////////
// MIT License  Copyright (c) 2025 Mikhail Nastaskov
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Обновляет настройки правил фильтрации для указанных объектов регистрации.
// Сохраняет существующие настройки при изменении состава объектов.
//
// Параметры:
//    Узел                               - ОпределяемыйТип.ПРО_УзелПланаОбмена - ссылка на узел плана обмена
//    АктуальныеИдентификаторыПОД        - Массив Из ОпределяемыйТип.ПРО_ИдентификаторОбъектаМетаданных - идентификаторы 
//                                         объектов из ПОД.
//    ИдентификаторыИзСоставаПланаОбмена - Массив Из ОпределяемыйТип.ПРО_ИдентификаторОбъектаМетаданных - идентификаторы 
//                                         объектов только из состава плана обмена (не входящие в ПОД)
//
Процедура АктуализироватьПравилаРегистрации(Узел, АктуальныеИдентификаторыПОД, ИдентификаторыИзСоставаПланаОбмена) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировки = БлокировкаДанных.Добавить(
			"РегистрСведений.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов");
		ЭлементБлокировки.УстановитьЗначение("УзелИнформационнойБазы", Узел);
		ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();
		
		НаборЗаписей = СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.УзелИнформационнойБазы.Установить(Узел);
		НаборЗаписей.Прочитать();
		
		// Индексируем текущие настройки
		СуществующиеНастройки = НаборЗаписей.Выгрузить();
		СуществующиеНастройки.Индексы.Добавить("ОбъектРегистрации");
		
		ЗаполнитьНаборЗаписей(НаборЗаписей, СуществующиеНастройки,
			Узел, АктуальныеИдентификаторыПОД, ИдентификаторыИзСоставаПланаОбмена);
		
		// Записываем с замещением
		НаборЗаписей.Записать(РежимЗамещения.Замещение);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстОшибки = НСтр("ru = 'Не удалось актуализировать правила регистрации объектов узла.
		                         |Причина: %1'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ПРО_УправлениеПравиламиРегистрацииСлужебный.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов, ,
			ТекстОшибки
		);
		
		ВызватьИсключение НСтр("ru = 'Не удалось актуализировать правила регистрации объектов узла'")
			+ Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		
	КонецПопытки;
	
КонецПроцедуры

// Изменяет настройку правила регистрации объектов в информационном регистре.
//
// Параметры:
//   НастройкаЗаписи - Структура - Состав См.НовыйПараметрыПереопределяемогоПравила
//
Процедура ИзменитьНастройкуПравила(НастройкаЗаписи) Экспорт
	
	МенеджерЗаписи = СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, НастройкаЗаписи);
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		
		ТекстОшибки = НСтр("ru = 'Не удалось изменить запись в регистре переопределяемых правил регистрации объектов.
		                         |Причина: %1'");
		ТекстОшибки = СтрШаблон(ТекстОшибки, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ЗаписьЖурналаРегистрации(
			ПРО_УправлениеПравиламиРегистрацииСлужебный.ИмяСобытияЖурналаРегистрации(),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.РегистрыСведений.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов, ,
			ТекстОшибки
		);
		
		ВызватьИсключение НСтр("ru = 'Не удалось изменить запись в регистре переопределяемых правил регистрации объектов'")
			+ Символы.ПС + ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
	КонецПопытки;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция НовыйПараметрыПереопределяемогоПравила() Экспорт
	
	Параметры = Новый Структура;
	Параметры.Вставить("УзелИнформационнойБазы", );
	Параметры.Вставить("ОбъектРегистрации", );
	Параметры.Вставить("РегистрацияОбъектаРазрешена", Ложь);
	Параметры.Вставить("ЭтоПОД", Ложь);
	Параметры.Вставить("ПрименитьСобственноеПравило", Ложь);
	Параметры.Вставить("ИсполняемыйКод", "");
	
	Возврат Параметры;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область АктуализацияСпискаПравилРегистрации

// Формирует итоговый состав набора записей:
//    - устаревшие записи не переносятся (удаляются неявно через Замещение)
//    - существующие настройки сохраняются через ЗаполнитьЗначенияСвойств
//    - новые объекты добавляются с значениями по умолчанию
//
// Параметры:
//    НаборЗаписей                    - РегистрСведенийНаборЗаписей.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов 
//    СуществующиеНастройки           - ТаблицаЗначений - Таблица с составом полей регистра 
//                                                        ПРО_ПереопределяемыеПравилаРегистрацииОбъектов
//    Узел                            - ОпределяемыйТип.ПРО_УзелПланаОбмена
//    АктуальныеИдентификаторыПОД     - Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных,
//                                                СправочникСсылка.ИдентификаторыОбъектовРасширений
//    ИдентификаторыТолькоПланаОбмена - Массив из СправочникСсылка.ИдентификаторыОбъектовМетаданных,
//                                                СправочникСсылка.ИдентификаторыОбъектовРасширений
//
Процедура ЗаполнитьНаборЗаписей(НаборЗаписей, СуществующиеНастройки,
		Узел, АктуальныеИдентификаторыПОД, ИдентификаторыТолькоПланаОбмена)
	
	НаборЗаписей.Очистить();
	
	Для Каждого Идентификатор Из АктуальныеИдентификаторыПОД Цикл
		НоваяСтрока = ДобавитьСтрокуВНабор(НаборЗаписей, СуществующиеНастройки, Узел, Идентификатор);
		НоваяСтрока.ЭтоПОД = Истина;
	КонецЦикла;
	
	Для Каждого Идентификатор Из ИдентификаторыТолькоПланаОбмена Цикл
		НоваяСтрока = ДобавитьСтрокуВНабор(НаборЗаписей, СуществующиеНастройки, Узел, Идентификатор);
		НоваяСтрока.ЭтоПОД = Ложь;
	КонецЦикла;
	
КонецПроцедуры

// Добавляет строку в набор записей: восстанавливает существующие настройки
// или инициализирует новую запись с ключевыми измерениями.
//
// Параметры:
//    НаборЗаписей          - РегистрСведенийНаборЗаписей.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов
//    СуществующиеНастройки - ТаблицаЗначений - Таблица с составом полей регистра 
//                                                        ПРО_ПереопределяемыеПравилаРегистрацииОбъектов
//    Узел                  - ОпределяемыйТип.ПРО_УзелПланаОбмена
//    Идентификатор         - СправочникСсылка
//
// Возвращаемое значение:
//    РегистрСведенийНаборЗаписей.ПРО_ПереопределяемыеПравилаРегистрацииОбъектов
//
Функция ДобавитьСтрокуВНабор(НаборЗаписей, СуществующиеНастройки, Узел, Идентификатор)
	
	НоваяСтрока = НаборЗаписей.Добавить();
	
	СтрокаНастройки = СуществующиеНастройки.Найти(Идентификатор, "ОбъектРегистрации");
	Если СтрокаНастройки <> Неопределено Тогда
		// Восстанавливаем все ресурсы - пользовательские настройки не теряем
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНастройки);
	Иначе
		НоваяСтрока.УзелИнформационнойБазы = Узел;
		НоваяСтрока.ОбъектРегистрации      = Идентификатор;
		НоваяСтрока.РегистрацияОбъектаРазрешена = Истина;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

#КонецОбласти


#КонецОбласти

#КонецЕсли
